# IsNested Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..IsNested Property
LinkLoadResult Class See Also
---
True if these results represent a nested link; false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsNested { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsNested As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsNested {
	bool get ();
}
```

# Remarks
This property is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace